Revit 2026 API

# ServerPath Methods

---

The ServerPath type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Compare | Compares this ModelPath with another (Inherited from ModelPath) |
|  | Dispose | (Inherited from ModelPath) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetModelGUID | A GUID identifying the Revit cloud model. (Inherited from ModelPath) |
|  | GetProjectGUID | A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated. (Inherited from ModelPath) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ServerPath Class

Autodesk.Revit.DB Namespace